api/app/controllers/api/v1/cards_controller.rb

INSERT INTO "cards" ("list_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["list_id", 3], ["title", "asdf"], ["created_at", 2016-11-16 00:00:01 UTC], ["updated_at", 2016-11-16 00:00:01 UTC]]
---
  def create
    @card = Card.new(card_params)
    if @card.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."list_id" = ?  [["list_id", 3]]
SELECT "cards".* FROM "cards"
---
  def index
    if params[:list_id]
      @cards = List.find(params[:list_id]).cards
    else
      @cards = Card.all

DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 21]]
---
  def destroy
    Card.destroy(params[:id])