api/app/controllers/api/v1/cards_controller.rb

  def destroy
    # TODO: how does this work with organizations cards?
    if current_user.cards.exists?(params[:id])
      @card = Card.find(params[:id])
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]