api/app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("payload", "card_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["payload", "This is a comment"], ["card_id", 1], ["created_at", 2016-11-09 19:37:08 UTC], ["updated_at", 2016-11-09 19:37:08 UTC]]
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save