api/app/controllers/api/v1/join_requests_controller.rb

  def index
    if params[:organization_id]
      @organization = Organization.find(params[:organization_id])
      @message = "Rendering organizations join requests."
      @join_requests = @organization.join_requests
    else
      @message = "Rendering all join requests."
      @join_requests = JoinRequest.all
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "join_requests".* FROM "join_requests" WHERE "join_requests"."organization_id" = ?  [["organization_id", 1]]