api/app/controllers/api/v1/lists_controller.rb

INSERT INTO "lists" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Dynamite"], ["user_id", 1], ["created_at", 2016-11-15 20:38:50 UTC], ["updated_at", 2016-11-15 20:38:50 UTC]]
---
  def create
    @list = List.new(list_params)
    if @list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "Dynamites"], ["updated_at", 2016-11-15 21:24:58 UTC], ["id", 3]]
---
  def update
    @list = List.find(params[:id])
    if @list.update_attributes(list_params)

SELECT "lists".* FROM "lists"
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
  def destroy
    if current_user.lists.exists?(params[:id])
      @list = List.find(params[:id])
      @list.destroy!

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @list = current_user.lists.find(params[:id])