api/app/controllers/api/v1/organizations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def create
    user = User.find(params[:user_id])