api/app/controllers/api/v1/organizations_controller.rb

INSERT INTO "organizations" ("admin_id", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["admin_id", 1], ["created_at", 2016-11-20 23:45:29 UTC], ["updated_at", 2016-11-20 23:45:29 UTC], ["title", "Launchschool"]]
INSERT INTO "users" ("fullname", "created_at", "updated_at", "email", "password_digest", "admin", "organization_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    # TODO: Refactor to use transactions to guarantee both organization
    # and membership happen together.
    @organization = Organization.new(organization_params)
    if @organization.save
      @membership = Membership.create(
        organization: @organization,
        user: current_user,
        approved: true
      )

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "organizations".* FROM "organizations"
---
  def index
    if params[:user_id]
      @organizations = User.find(params[:user_id]).organizations
      @message = "Users organizations retrieved."
    else
      @organizations = Organization.all

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @organization = Organization.find(params[:id])