api/app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alice@doe.com"], ["LIMIT", 1]]
---
  def create
    @auth = AuthenticateUser.call(session_params[:email], session_params[:password])
    if @auth.success?
      @user =  User.find_by(email: session_params[:email])