api/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("fullname", "created_at", "updated_at") VALUES (?, ?, ?)  [["fullname", "Alice Doe"], ["created_at", 2016-11-07 21:10:17 UTC], ["updated_at", 2016-11-07 21:10:17 UTC]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "organization_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["organization_id", 1], ["updated_at", 2016-11-21 22:49:20 UTC], ["id", 2]]
---
  def update
    org = Organization.find(user_params[:organization_id])
    if current_user.update_attributes(organization_id: org.id)